Revit 2025 API
ExternalServices.BuiltInExternalServices.GeometryAugmentationService Property
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ExternalServiceId GeometryAugmentationService { get; }
Public Shared ReadOnly Property GeometryAugmentationService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ GeometryAugmentationService {
	ExternalServiceId^ get ();
}
static member GeometryAugmentationService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace